var vArea = {
  "_9": {
    "_1": "北基宜",
    "_2": "桃竹苗",
    "_3": "中彰投",
    "_4": "雲嘉南",
    "_5": "高屏",
    "_6": "花東",
    "_7": "澎金馬蘭綠離島"
  }
};
var vTcity = {
  "_1": {
    "_TPE": "台北",
    "_KLU": "基隆",
    "_PAN": "板橋",
    "_YLN": "宜蘭"
  },
  "_2": {
    "_TAO": "桃園",
    "_HCU": "新竹",
    "_MLI": "苗栗"
  },
  "_3": {
    "_TCH": "台中",
    "_CHA": "彰化",
    "_NTO": "南投"
  },
  "_4": {
    "_YLI": "雲林",
    "_CYI": "嘉義",
    "_TNN": "台南"
  },
  "_5": {
    "_KHH": "高雄",
    "_PIN": "屏東"
  },
  "_6": {
    "_HLN": "花蓮",
    "_TTT": "台東"
  },
  "_7": {
    "_MZG": "澎湖",
    "_KNH": "金門",
    "_MFK": "馬祖"
  }
};